/*
 * Copyright (c) 2025, Texas Instruments Incorporated
 * 版权所有 (c) 2025，德州仪器公司 (Texas Instruments Incorporated)
 *
 * 允许在源代码和二进制形式下进行再分发和使用（无论是否经过修改），
 * 但必须满足以下条件：
 *
 * - 源代码的再分发必须保留上述版权声明、本条件列表以及以下免责声明。
 * - 二进制形式的再分发必须在提供的文档和/或其他材料中复制上述版权声明、
 *   本条件列表以及以下免责声明。
 * - 未经事先书面许可，不得使用 Texas Instruments Incorporated 或其
 *   贡献者的名称来支持或推广源自本软件的产品。
 *
 * 本软件由版权持有人和贡献者按“原样”提供，对任何明示或暗示的担保
 * （包括但不限于适销性和特定用途适用性的默示担保）不作任何保证。
 * 在任何情况下，版权持有人或贡献者均不对因使用本软件而导致的任何
 * 直接、间接、偶发、特殊、惩戒性或后果性损害（包括但不限于采购替代
 * 商品或服务；使用损失、数据丢失或利润损失；业务中断等）承担责任，
 * 无论其是基于合同、严格责任还是侵权行为（包括疏忽或其他原因），
 * 即使已被告知可能会发生此类损害。
 */

#include <ti/driverlib/dl_npu.h>

#ifdef __MSPM0_HAS_NPU__

#endif /* __MSPM0_HAS_NPU__ */
